# RbsElecLoadsummaryConnectedLoadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecLoadsummaryConnectedLoadParam Property
ParameterTypeId Class See Also
---
"Connected Load (VA)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecLoadsummaryConnectedLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecLoadsummaryConnectedLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecLoadsummaryConnectedLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace